## [terraform-starter](https://ojcorzog.app.spacelift.io/stack/terraform-starter/run/01GWNF4PTRFMPA0HTMWVQ3MK71) plan logs

<details>
<summary>Click here to expand</summary>

```
[01GWMT6EHNMNFGH7NGC6FZXDN0] Planning changes with 0 custom hooks...
spacelift_context.managed: Refreshing state... [id=managed-context]
spacelift_policy.push: Refreshing state... [id=ignore-commits-outside-the-project-root]
spacelift_policy.comments: Refreshing state... [id=plan-from-pr-comments]
spacelift_policy.login: Refreshing state... [id=devops-are-admins]
spacelift_policy.access: Refreshing state... [id=all-of-engineering-gets-read-access]
spacelift_policy.trigger: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency]
data.spacelift_ips.ips: Reading...
spacelift_policy.task: Refreshing state... [id=allow-only-safe-commands]
spacelift_policy.plan: Refreshing state... [id=enforce-password-strength]
data.spacelift_current_stack.this: Reading...
data.spacelift_current_stack.this: Read complete after 0s [id=terraform-starter]
random_password.context-password: Refreshing state... [id=none]
random_password.stack-password: Refreshing state... [id=none]
spacelift_policy_attachment.trigger-self: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency/01GWJEBYRXRWRFQMW6K9DHCR0T]
spacelift_stack.managed: Refreshing state... [id=managed-stack]
data.spacelift_ips.ips: Read complete after 0s [id=spacelift-ips]
spacelift_environment_variable.context-writeonly: Refreshing state... [id=context/managed-context/CONTEXT_SECRET]
spacelift_environment_variable.context-plaintext: Refreshing state... [id=context/managed-context/CONTEXT_PUBLIC]
spacelift_mounted_file.context-secret-file: Refreshing state... [id=context/managed-context/context-secret-password.json]
spacelift_mounted_file.stack-plaintext-file: Refreshing state... [id=stack/managed-stack/stack-plaintext-ips.json]
spacelift_policy_attachment.access: Refreshing state... [id=all-of-engineering-gets-read-access/01GWJGNF10KFBJCRYC4NG975GN]
spacelift_policy_attachment.trigger: Refreshing state... [id=trigger-stacks-that-declare-an-explicit-dependency/01GWJEBZS1Q9TRE40NHPRZH35C]
spacelift_policy_attachment.comments: Refreshing state... [id=plan-from-pr-comments/01GWNEDBQN1PE4FX383Y1B4J9J]
spacelift_policy_attachment.push: Refreshing state... [id=ignore-commits-outside-the-project-root/01GWJGNF7J4KPFKX4VVAHMQN1Y]
spacelift_environment_variable.stack-writeonly: Refreshing state... [id=stack/managed-stack/STACK_SECRET]
spacelift_policy_attachment.plan: Refreshing state... [id=enforce-password-strength/01GWJGNF2QCEHQSVNMM1FZMXDY]
spacelift_context_attachment.managed: Refreshing state... [id=managed-context/01GWJGNFB1M1ARBC9C1FAJ3MVY]
spacelift_mounted_file.stack-secret-file: Refreshing state... [id=stack/managed-stack/stack-secret-password.json]
spacelift_environment_variable.stack-plaintext: Refreshing state... [id=stack/managed-stack/STACK_PUBLIC]
spacelift_policy_attachment.task: Refreshing state... [id=allow-only-safe-commands/01GWJGNF71VSE1E330WWF1N979]
spacelift_mounted_file.context-plaintext-file: Refreshing state... [id=context/managed-context/context-plaintext-file.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_password.context-password must be replaced
-/+ resource "random_password" "context-password" {
      ~ bcrypt_hash = (sensitive value)
      ~ id          = "none" -> (known after apply)
      ~ length      = 32 -> 35 # forces replacement
      ~ result      = (sensitive value)
        # (9 unchanged attributes hidden)
    }

  # spacelift_environment_variable.context-writeonly must be replaced
-/+ resource "spacelift_environment_variable" "context-writeonly" {
      ~ checksum   = "99e29555bd42144f66757934e533eee3138ddd588dbd7275bfd70b901c299506" -> (known after apply)
      ~ id         = "context/managed-context/CONTEXT_SECRET" -> (known after apply)
        name       = "CONTEXT_SECRET"
      ~ value      = (sensitive value) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # spacelift_mounted_file.context-secret-file must be replaced
-/+ resource "spacelift_mounted_file" "context-secret-file" {
      ~ checksum      = "8c9268f87136776778ce9856b2409a9c8663e98a0b3ee667ff914e3d86dd0b06" -> (known after apply)
      ~ content       = (sensitive value) # forces replacement
      ~ id            = "context/managed-context/context-secret-password.json" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # spacelift_policy.comments will be destroyed
  # (because spacelift_policy.comments is not in configuration)
  - resource "spacelift_policy" "comments" {
      - body     = <<-EOT
            package spacelift
            
            # This policy requires the following permissions on your VCS provider:
            # - Read access to `issues` repository permissions
            # - Subscribe to `issues:comments` event
            # These are likely to be set already. If so, no action is needed.
            #
            # Assuming the above permissions are configured on your VCS application,
            # you can then access pull request comment event data from within your Push policy,
            # and build customizable workflows using this data.
            #
            # Please note that Spacelift will only evaluate comments that begin with`/spacelift`
            # to prevent users from unintended actions against their resources managed by Spacelift.
            # Furthermore, Spacelift only processes event data for new comments,
            # and will not receive event data for edited or deleted comments.
            
            track {
            	input.pull_request.action == "commented"
            	input.pull_request.comment == concat(" ", ["/spacelift", "deploy", input.stack.id])
            }
        EOT -> null
      - id       = "plan-from-pr-comments" -> null
      - labels   = [] -> null
      - name     = "deploy from pr comments" -> null
      - space_id = "legacy" -> null
      - type     = "GIT_PUSH" -> null
    }

  # spacelift_policy.comments_deploy will be created
  + resource "spacelift_policy" "comments_deploy" {
      + body     = <<-EOT
            package spacelift
            
            # This policy requires the following permissions on your VCS provider:
            # - Read access to `issues` repository permissions
            # - Subscribe to `issues:comments` event
            # These are likely to be set already. If so, no action is needed.
            #
            # Assuming the above permissions are configured on your VCS application,
            # you can then access pull request comment event data from within your Push policy,
            # and build customizable workflows using this data.
            #
            # Please note that Spacelift will only evaluate comments that begin with`/spacelift`
            # to prevent users from unintended actions against their resources managed by Spacelift.
            # Furthermore, Spacelift only processes event data for new comments,
            # and will not receive event data for edited or deleted comments.
            
            track {
            	input.pull_request.action == "commented"
            	input.pull_request.comment == concat(" ", ["/spacelift", "deploy", input.stack.id])
            }
        EOT
      + id       = (known after apply)
      + name     = "deploy from pr comments"
      + space_id = (known after apply)
      + type     = "GIT_PUSH"
    }

  # spacelift_policy.comments_plan will be created
  + resource "spacelift_policy" "comments_plan" {
      + body     = <<-EOT
            package spacelift
            
            # This policy requires the following permissions on your VCS provider:
            # - Read access to `issues` repository permissions
            # - Subscribe to `issues:comments` event
            # These are likely to be set already. If so, no action is needed.
            #
            # Assuming the above permissions are configured on your VCS application,
            # you can then access pull request comment event data from within your Push policy,
            # and build customizable workflows using this data.
            #
            # Please note that Spacelift will only evaluate comments that begin with`/spacelift`
            # to prevent users from unintended actions against their resources managed by Spacelift.
            # Furthermore, Spacelift only processes event data for new comments,
            # and will not receive event data for edited or deleted comments.
            
            track {
            	input.pull_request.action == "commented"
            	input.pull_request.comment == concat(" ", ["/spacelift", "plan", input.stack.id])
            }
        EOT
      + id       = (known after apply)
      + name     = "plan from pr comments"
      + space_id = (known after apply)
      + type     = "GIT_PUSH"
    }

  # spacelift_policy_attachment.comments must be replaced
-/+ resource "spacelift_policy_attachment" "comments" {
      ~ id        = "plan-from-pr-comments/01GWNEDBQN1PE4FX383Y1B4J9J" -> (known after apply)
      ~ policy_id = "plan-from-pr-comments" # forces replacement -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # spacelift_policy_attachment.comments_deploy will be created
  + resource "spacelift_policy_attachment" "comments_deploy" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + stack_id  = "managed-stack"
    }

Plan: 7 to add, 0 to change, 5 to destroy.

[01GWMT6EHNMNFGH7NGC6FZXDN0] Changes are GO
[01GWMT6EHNMNFGH7NGC6FZXDN0] Uploading the list of managed resources...
[01GWMT6EHNMNFGH7NGC6FZXDN0] Please be aware that Run changes calculation includes Terraform output changes.
[01GWMT6EHNMNFGH7NGC6FZXDN0] Resource list upload is GO
[01GWMT6EHNMNFGH7NGC6FZXDN0] Generating JSON representation of the plan...
[01GWMT6EHNMNFGH7NGC6FZXDN0] JSON representation is GO
[01GWMT6EHNMNFGH7NGC6FZXDN0] Loading custom plan policy inputs...
[01GWMT6EHNMNFGH7NGC6FZXDN0] 0 custom plan policy inputs found
[01GWMT6EHNMNFGH7NGC6FZXDN0] No plan policies to evaluate
```

</details>